cheatsheets/jupyterlab-config.org
:PROPERTIES:
:ID:       fced3efe-57c5-4c89-8ae7-37bc272e4d29
:END:
#+TITLE: Jupyter Lab: Config
#+TAGS:
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes
#+OPTIONS: ':nil *:t -:t ::t <:t \n:nil ^:t arch:headline
#+OPTIONS: author:nil c:nil d:(not "LOGBOOK") date:nil
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:nil todo:t |:t
#+OPTIONS: toc:nil
#+OPTIONS: html-style:link
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="jupyterlab-config.css" />
# #+BIND: org-html-htmlize-output-type nil
#+SELECT_TAGS:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en


#+begin_export html
<pre>
#+end_export

#+begin_verse
_ServerApp_                               _ServerApp_                                _LabServerApp_                        _LabApp_

├── allow                               ├── preferred​_​dir                        ├── allowed​_​extensions​_​uris         ├── allowed​_​extensions​_​uris
│   ├── credentials = /False/             ├── pylab = /'disabled'/                   ├── answer​_​yes                      ├── answer​_​yes
│   ├── external​_​kernels = /False/        ├── quit​_​button                          ├── app                             ├── app
│   ├── origin                          ├── rate​_​limit​_​window = /0.0/              │   ├── settings​_​dir                │   ├── dir = /None/
│   │   └── pat                         ├── reraise​_​server​_​extension​_​failures    │   └── url = /'/lab'/                │   ├── settings​_​dir
│   ├── password​_​change = /True/          ├── root​_​dir                             ├── blacklist​_​uris                  │   └── url = /'/lab'/
│   ├── remote​_​access = /False/           ├── session​_​manager​_​class                ├── blocked​_​extensions​_​uris         ├── blacklist​_​uris
│   ├── root = /False/                    ├── show​_​config                          ├── cache​_​files = /True/              ├── blocked​_​extensions​_​uris
│   └── unauthenticated​_​access = /True/   │   └── json                             ├── config​_​file                     ├── cache​_​files = /True/
├── answer​_​yes                          ├── shutdown​_​no​_​activity​_​timeout = /0/     │   └── name                        ├── check​_​for​_​updates​_​class
├── authenticate​_​prometheus = /True/      ├── sock                                 ├── copy​_​absolute​_​path              ├── collaborative = /False/
├── authorizer​_​class                    │   └── mode = /'0600'/                    ├── extra​_​labextensions​_​path        ├── config​_​file
├── autoreload = /True/                   ├── ssl​_​options = /{}/                     ├── generate​_​config                 │   └── name
├── base​_​url                            ├── static​_​immutable​_​cache = /[]/          ├── handlers = /[]/                   ├── copy​_​absolute​_​path
├── browser                             ├── terminado​_​settings = /{}/              ├── jinja2​_​options = /{}/             ├── core​_​mode
├── certfile                            ├── terminals​_​enabled = /False/            ├── labextensions                   ├── custom​_​css
│── client​_​ca                           ├── token                                │   ├── path = /[]/                   ├── default​_​url = /'/lab'/
├── config​_​file                         ├── tornado​_​settings = /{}/                │   └── url                         ├── dev​_​mode = /False/
│   └── name                            ├── trust​_​xheaders = /False/               ├── listings                        ├── expose​_​app​_​in​_​browser = /False/
├── config​_​manager​_​class                ├── use​_​redirect​_​file = /True/             │   ├── refresh​_​seconds = /3600/      ├── extension​_​manager = /'pypi'/
├── contents​_​manager​_​class              ├── webbrowser​_​open​_​new = /2/              │   ├── request​_​options = /{}/        ├── extensions​_​in​_​dev​_​mode = /False/
├── cookie                              └── websocket                            │   └── url                         ├── extra​_​labextensions​_​path = /[]/
│   ├── options = /{}/                        ├── compression​_​options = /None/       ├── log                             ├── generate​_​config
│   └── secret                              ├── ping                             │   ├── datefmt                     ├── handlers = /[]/
│       └── file                            │   ├── interval = /0/                 │   ├── format                      ├── jinja2​_​options = /{}/
├── custom​_​display​_​url                      │   └── timeout = /0/                  │   └── level                       ├── labextensions
├── default​_​url                             └── url                              ├── logging​_​config                  │   ├── path = /[]/
├── disable​_​check​_​xsrf                                                           ├── notebook​_​starts​_​kernel = /True/   │   └── url
├── external​_​connection​_​dir = /None/      _Application_                              ├── open​_​browser                    ├── listings
├── extra                                                                        ├── schemas​_​dir                     │   ├── refresh​_​seconds = /3600/
│   ├── log​_​scrub​_​param​_​keys = /[]/       ├── log                                  ├── settings = /{}/                   │   ├── request​_​options = /{}/
│   ├── services = /[]/                   │   ├── datefmt                          │   └── url                         │   └── url
│   ├── static​_​paths = /[]/               │   ├── format                           ├── show​_​config                     ├── lock​_​all​_​plugins
│   └── template​_​paths = /[]/             │   └── level                            │   └── json                        ├── log
├── file                                ├── logging​_​config = /{}/                  ├── static                          │   ├── datefmt
│   ├── to​_​run                          └── show​_​config                          │   ├── dir                         │   ├── format
│   └── url​_​prefix = /'notebooks'/            └── json                             │   ├── paths = /[]/                  │   └── level
├── generate​_​config                                                              │   └── url​_​prefix                  ├── logging​_​config = /{}/
├── get​_​secure​_​cookie​_​kwargs = /{}/                                                ├── template​_​paths = /[]/             ├── news​_​url
├── identity​_​provider​_​class             _JupyterApp_                               ├── templates​_​dir                   ├── notebook​_​starts​_​kernel
├── iopub                                                                        ├── themes                          ├── open​_​browser
│   ├── data​_​rate​_​limit = /0.0/           ├── answer​_​yes                           │   ├── dir                         ├── override
│   └── msg​_​rate​_​limit = /0.0/            ├── config​_​file                          │   └── url                         │   ├── static​_​url
├── ip = /'localhost'/                    │   └── name                             ├── translations​_​api​_​url            │   └── theme​_​url
├── jinja                               ├── generate​_​config                      ├── tree​_​url                        ├── schemas​_​dir
│   ├── environment​_​options = /{}/        ├── log                                  ├── user​_​settings​_​dir               ├── settings = /{}/
│   └── template​_​vars = /{}/              │   ├── datefmt                          ├── whitelist​_​uris                  │   └── url
├── jpserver​_​extensions = /{}/            │   ├── format                           └── workspaces                      ├── show​_​config
├── kernel                              │   └── level                                ├── api​_​url                     │   └── json
│   ├── manager​_​class                   ├── logging​_​config = /{}/                      └── dir                         ├── skip​_​dev​_​build
│   ├── spec​_​manager​_​class              └── show​_​config                                                              ├── splice​_​source
│   ├── websocket​_​connection​_​class          └── json                                                                 ├── static
│   └── ws​_​protocol                                                                                                  │   ├── dir
├── keyfile                                                                                                          │   ├── paths = /[]/
├── limit​_​rate = /False/                  _ExtensionApp_                                                                 │   └── url​_​prefix
├── local​_​hostnames = /['localhost']/                                                                                  ├── template​_​paths = /[]/
├── log                                 ├── answer​_​yes                                                               ├── templates​_​dir
│   ├── datefmt                         ├── config​_​file                                                              ├── themes
│   ├── format                          │   └── name                                                                 │   ├── dir
│   └── level                           ├── default​_​url                                                              │   └── url
├── logging​_​config = /{}/                 ├── generate​_​config                                                          ├── translations​_​api​_​url
├── login​_​handler​_​class                 ├── handlers                                                                 ├── tree​_​url
├── logout​_​handler​_​class                ├── log                                                                      ├── user​_​settings​_​dir
├── max                                 │   ├── datefmt                                                              ├── watch = /False/
│    ├── body​_​size = /536870912/          │   ├── format                                                               ├── whitelist​_​uris
│    └── buffer​_​size = /536870912/        │   └── level                                                                └── workspaces
├── min​_​open​_​files​_​limit = /0/            ├── logging​_​config = /{}/                                                          ├── api​_​url
├── notebook​_​dir                        ├── open​_​browser                                                                 └── dir
├── open​_​browser                        ├── settings = /{}/
├── password​_required = /False/           ├── show​_​config
└── port = /0/                            │   └── json
    └── retries = /50/                    ├── static​_​paths = /[]/
                                        ├── static​_​url​_​prefix
                                        └── template​_​paths = /[]/




                                        
#+end_verse



|--------------------------+--------------------------------------------------|
| LabApp                   |                                                  |
|--------------------------+--------------------------------------------------|
| news​_​url                | https://jupyterlab.github.io/assets/feed.xml     |
| check​_​for​_​updates​_​class | jupyterlab.handlers.announcements.CheckForUpdate |
| user​_​settings​_​dir       | $HOME/.jupyter/lab/user-settings                 |
| workspaces​_​dir          | '/home/dc/.jupyter/lab/workspaces'                 |
|--------------------------+--------------------------------------------------|

#+begin_verse


        *@jupyterlab* schemas

        ├── *application-extension*                            ├── *extensionmanager-extension*             ├── *notebook-extension*
        │   ├── commands.json                                │   └── plugin.json                        │   ├── completer.json
        │   ├── context-menu.json                            ├── *filebrowser-extension*                  │   ├── export.json
        │   ├── property-inspector.json                      │   ├── browser.json                       │   ├── panel.json
        │   ├── shell.json                                   │   ├── download.json                      │   ├── tools.json
        │   └── top-bar.json                                 │   ├── open-browser-tab.json              │   └── tracker.json
        ├── *apputils-extension*                               │   ├── open-with.json                     ├── *running-extension*
        │   ├── kernels-settings.json                        │   └── widget.json                        │   └── plugin.json
        │   ├── notification.json                            ├── *fileeditor-extension*                   ├── *settingeditor-extension*
        │   ├── palette.json                                 │   ├── completer.json                     │   ├── form-ui.json
        │   ├── print.json                                   │   └── plugin.json                        │   └── plugin.json
        │   ├── sanitizer.json                               ├── *help-extension*                         ├── *shortcuts-extension*
        │   ├── sessionDialogs.json                          │   ├── about.json                         │   └── shortcuts.json
        │   ├── themes.json                                  │   ├── jupyter-forum.json                 ├── *statusbar-extension*
        │   └── utilityCommands.json                         │   └── launch-classic.json                │   └── plugin.json
        ├── *celltags-extension*                               ├── *htmlviewer-extension*                   ├── *terminal-extension*
        │   └── plugin.json                                  │   └── plugin.json                        │   └── plugin.json
        ├── *cell-toolbar-extension*                           ├── *hub-extension*                          ├── *toc-extension*
        │   └── plugin.json                                  │   └── menu.json                          │   └── registry.json
        ├── *codemirror-extension*                             ├── *imageviewer-extension*                  ├── *tooltip-extension*
        │   └── plugin.json                                  │   └── plugin.json                        │   ├── consoles.json
        ├── *completer-extension*                              ├── *inspector-extension*                    │   ├── files.json
        │   ├── inline-completer.json                        │   ├── consoles.json                      │   └── notebooks.json
        │   └── manager.json                                 │   ├── inspector.json                     ├── *translation-extension*
        ├── *console-extension*                                │   └── notebooks.json                     │   └── plugin.json
        │   ├── completer.json                               ├── *launcher-extension*                     └── *workspaces-extension*
        │   ├── foreign.json                                 │   └── plugin.json                            ├── indicator.json
        │   └── tracker.json                                 ├── *logconsole-extension*                       ├── menu.json
        ├── *csvviewer-extension*                              │   └── plugin.json                            └── sidebar.json
        │   ├── csv.json                                     ├── *lsp-extension*
        │   └── tsv.json                                     │   └── plugin.json
        ├── *debugger-extension*                               ├── *mainmenu-extension*
        │   └── main.json                                    │   └── plugin.json
        ├── *docmanager-extension*                             ├── *markdownviewer-extension*
        │   ├── download.json                                │   └── plugin.json
        │   └── plugin.json                                  ├── *mathjax-extension*
        └── *documentsearch-extension*                         │   └── plugin.json
            └── plugin.json                                  └── *metadataform-extension*
                                                                 └── metadataforms.json


#+end_verse


|------------------------------------+--------------------------------------------------------------------------------|
| ServerApp                          |                                                                                |
|------------------------------------+--------------------------------------------------------------------------------|
| authorizer​_​class                  | jupyter​_​server.auth.authorizer.AllowAllAuthorizer                             |
| config​_​manager​_​class              | jupyter​_​server.services.config.manager.ConfigManager                          |
| contents​_​manager​_​class            | jupyter​_​server.services.contents.largefilemanager.AsyncLargeFileManager       |
| identity​_​provider​_​class           | jupyter​_​server.auth.identity.PasswordIdentityProvider                         |
| kernel​_​manager​_​class              | jupyter​_​server.services.kernels.kernelmanager.MappingKernelManager            |
| kernel​_​spec​_​manager​_​class         | builtins.object                                                                |
| kernel​_​websocket​_​connection​_​class | jupyter​_​server.services.kernels.connection.base.BaseKernelWebsocketConnection |
| login​_​handler​_​class               | jupyter​_​server.auth.login.LegacyLoginHandler                                  |
| logout​_​handler​_​class              | jupyter​_​server.auth.logout.LogoutHandler                                      |
| session​_​manager​_​class             | builtins.object                                                                |
|------------------------------------+--------------------------------------------------------------------------------|


#+begin_export html
</pre>
#+end_export


