cheatsheets/jupyterlab-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jupyter Lab: Config</title>
<meta name="description" content="notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="jupyterlab-config.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Jupyter Lab: Config</h1>
<pre>

<p class="verse">
<span class="underline">ServerApp</span>                               <span class="underline">ServerApp</span>                                <span class="underline">LabServerApp</span>                        <span class="underline">LabApp</span><br />
<br />
├── allow                               ├── preferred​_​dir                        ├── allowed​_​extensions​_​uris         ├── allowed​_​extensions​_​uris<br />
│   ├── credentials = <i>False</i>             ├── pylab = <i>'disabled'</i>                   ├── answer​_​yes                      ├── answer​_​yes<br />
│   ├── external​_​kernels = <i>False</i>        ├── quit​_​button                          ├── app                             ├── app<br />
│   ├── origin                          ├── rate​_​limit​_​window = <i>0.0</i>              │   ├── settings​_​dir                │   ├── dir = <i>None</i><br />
│   │   └── pat                         ├── reraise​_​server​_​extension​_​failures    │   └── url = <i>'/lab'</i>                │   ├── settings​_​dir<br />
│   ├── password​_​change = <i>True</i>          ├── root​_​dir                             ├── blacklist​_​uris                  │   └── url = <i>'/lab'</i><br />
│   ├── remote​_​access = <i>False</i>           ├── session​_​manager​_​class                ├── blocked​_​extensions​_​uris         ├── blacklist​_​uris<br />
│   ├── root = <i>False</i>                    ├── show​_​config                          ├── cache​_​files = <i>True</i>              ├── blocked​_​extensions​_​uris<br />
│   └── unauthenticated​_​access = <i>True</i>   │   └── json                             ├── config​_​file                     ├── cache​_​files = <i>True</i><br />
├── answer​_​yes                          ├── shutdown​_​no​_​activity​_​timeout = <i>0</i>     │   └── name                        ├── check​_​for​_​updates​_​class<br />
├── authenticate​_​prometheus = <i>True</i>      ├── sock                                 ├── copy​_​absolute​_​path              ├── collaborative = <i>False</i><br />
├── authorizer​_​class                    │   └── mode = <i>'0600'</i>                    ├── extra​_​labextensions​_​path        ├── config​_​file<br />
├── autoreload = <i>True</i>                   ├── ssl​_​options = <i>{}</i>                     ├── generate​_​config                 │   └── name<br />
├── base​_​url                            ├── static​_​immutable​_​cache = <i>[]</i>          ├── handlers = <i>[]</i>                   ├── copy​_​absolute​_​path<br />
├── browser                             ├── terminado​_​settings = <i>{}</i>              ├── jinja2​_​options = <i>{}</i>             ├── core​_​mode<br />
├── certfile                            ├── terminals​_​enabled = <i>False</i>            ├── labextensions                   ├── custom​_​css<br />
│── client​_​ca                           ├── token                                │   ├── path = <i>[]</i>                   ├── default​_​url = <i>'/lab'</i><br />
├── config​_​file                         ├── tornado​_​settings = <i>{}</i>                │   └── url                         ├── dev​_​mode = <i>False</i><br />
│   └── name                            ├── trust​_​xheaders = <i>False</i>               ├── listings                        ├── expose​_​app​_​in​_​browser = <i>False</i><br />
├── config​_​manager​_​class                ├── use​_​redirect​_​file = <i>True</i>             │   ├── refresh​_​seconds = <i>3600</i>      ├── extension​_​manager = <i>'pypi'</i><br />
├── contents​_​manager​_​class              ├── webbrowser​_​open​_​new = <i>2</i>              │   ├── request​_​options = <i>{}</i>        ├── extensions​_​in​_​dev​_​mode = <i>False</i><br />
├── cookie                              └── websocket                            │   └── url                         ├── extra​_​labextensions​_​path = <i>[]</i><br />
│   ├── options = <i>{}</i>                        ├── compression​_​options = <i>None</i>       ├── log                             ├── generate​_​config<br />
│   └── secret                              ├── ping                             │   ├── datefmt                     ├── handlers = <i>[]</i><br />
│       └── file                            │   ├── interval = <i>0</i>                 │   ├── format                      ├── jinja2​_​options = <i>{}</i><br />
├── custom​_​display​_​url                      │   └── timeout = <i>0</i>                  │   └── level                       ├── labextensions<br />
├── default​_​url                             └── url                              ├── logging​_​config                  │   ├── path = <i>[]</i><br />
├── disable​_​check​_​xsrf                                                           ├── notebook​_​starts​_​kernel = <i>True</i>   │   └── url<br />
├── external​_​connection​_​dir = <i>None</i>      <span class="underline">Application</span>                              ├── open​_​browser                    ├── listings<br />
├── extra                                                                        ├── schemas​_​dir                     │   ├── refresh​_​seconds = <i>3600</i><br />
│   ├── log​_​scrub​_​param​_​keys = <i>[]</i>       ├── log                                  ├── settings = <i>{}</i>                   │   ├── request​_​options = <i>{}</i><br />
│   ├── services = <i>[]</i>                   │   ├── datefmt                          │   └── url                         │   └── url<br />
│   ├── static​_​paths = <i>[]</i>               │   ├── format                           ├── show​_​config                     ├── lock​_​all​_​plugins<br />
│   └── template​_​paths = <i>[]</i>             │   └── level                            │   └── json                        ├── log<br />
├── file                                ├── logging​_​config = <i>{}</i>                  ├── static                          │   ├── datefmt<br />
│   ├── to​_​run                          └── show​_​config                          │   ├── dir                         │   ├── format<br />
│   └── url​_​prefix = <i>'notebooks'</i>            └── json                             │   ├── paths = <i>[]</i>                  │   └── level<br />
├── generate​_​config                                                              │   └── url​_​prefix                  ├── logging​_​config = <i>{}</i><br />
├── get​_​secure​_​cookie​_​kwargs = <i>{}</i>                                                ├── template​_​paths = <i>[]</i>             ├── news​_​url<br />
├── identity​_​provider​_​class             <span class="underline">JupyterApp</span>                               ├── templates​_​dir                   ├── notebook​_​starts​_​kernel<br />
├── iopub                                                                        ├── themes                          ├── open​_​browser<br />
│   ├── data​_​rate​_​limit = <i>0.0</i>           ├── answer​_​yes                           │   ├── dir                         ├── override<br />
│   └── msg​_​rate​_​limit = <i>0.0</i>            ├── config​_​file                          │   └── url                         │   ├── static​_​url<br />
├── ip = <i>'localhost'</i>                    │   └── name                             ├── translations​_​api​_​url            │   └── theme​_​url<br />
├── jinja                               ├── generate​_​config                      ├── tree​_​url                        ├── schemas​_​dir<br />
│   ├── environment​_​options = <i>{}</i>        ├── log                                  ├── user​_​settings​_​dir               ├── settings = <i>{}</i><br />
│   └── template​_​vars = <i>{}</i>              │   ├── datefmt                          ├── whitelist​_​uris                  │   └── url<br />
├── jpserver​_​extensions = <i>{}</i>            │   ├── format                           └── workspaces                      ├── show​_​config<br />
├── kernel                              │   └── level                                ├── api​_​url                     │   └── json<br />
│   ├── manager​_​class                   ├── logging​_​config = <i>{}</i>                      └── dir                         ├── skip​_​dev​_​build<br />
│   ├── spec​_​manager​_​class              └── show​_​config                                                              ├── splice​_​source<br />
│   ├── websocket​_​connection​_​class          └── json                                                                 ├── static<br />
│   └── ws​_​protocol                                                                                                  │   ├── dir<br />
├── keyfile                                                                                                          │   ├── paths = <i>[]</i><br />
├── limit​_​rate = <i>False</i>                  <span class="underline">ExtensionApp</span>                                                                 │   └── url​_​prefix<br />
├── local​_​hostnames = <i>['localhost']</i>                                                                                  ├── template​_​paths = <i>[]</i><br />
├── log                                 ├── answer​_​yes                                                               ├── templates​_​dir<br />
│   ├── datefmt                         ├── config​_​file                                                              ├── themes<br />
│   ├── format                          │   └── name                                                                 │   ├── dir<br />
│   └── level                           ├── default​_​url                                                              │   └── url<br />
├── logging​_​config = <i>{}</i>                 ├── generate​_​config                                                          ├── translations​_​api​_​url<br />
├── login​_​handler​_​class                 ├── handlers                                                                 ├── tree​_​url<br />
├── logout​_​handler​_​class                ├── log                                                                      ├── user​_​settings​_​dir<br />
├── max                                 │   ├── datefmt                                                              ├── watch = <i>False</i><br />
│    ├── body​_​size = <i>536870912</i>          │   ├── format                                                               ├── whitelist​_​uris<br />
│    └── buffer​_​size = <i>536870912</i>        │   └── level                                                                └── workspaces<br />
├── min​_​open​_​files​_​limit = <i>0</i>            ├── logging​_​config = <i>{}</i>                                                          ├── api​_​url<br />
├── notebook​_​dir                        ├── open​_​browser                                                                 └── dir<br />
├── open​_​browser                        ├── settings = <i>{}</i><br />
├── password​_required = <i>False</i>           ├── show​_​config<br />
└── port = <i>0</i>                            │   └── json<br />
&#xa0;   └── retries = <i>50</i>                    ├── static​_​paths = <i>[]</i><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── static​_​url​_​prefix<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;└── template​_​paths = <i>[]</i><br />
<br />
<br />
<br />
<br />
<br />
</p>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">LabApp</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">news​_​url</td>
<td class="org-left"><a href="https://jupyterlab.github.io/assets/feed.xml">https://jupyterlab.github.io/assets/feed.xml</a></td>
</tr>

<tr>
<td class="org-left">check​_​for​_​updates​_​class</td>
<td class="org-left">jupyterlab.handlers.announcements.CheckForUpdate</td>
</tr>

<tr>
<td class="org-left">user​_​settings​_​dir</td>
<td class="org-left"><code>$HOME/.jupyter/lab/user-settings</code></td>
</tr>

<tr>
<td class="org-left">workspaces​_​dir</td>
<td class="org-left"><code>$HOME/.jupyter/lab/workspaces</code></td>
</tr>
</tbody>
</table>

<p class="verse">
<br />
<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<b>@jupyterlab</b> schemas<br />
<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>application-extension</b>                            ├── <b>extensionmanager-extension</b>             ├── <b>notebook-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── commands.json                                │   └── plugin.json                        │   ├── completer.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── context-menu.json                            ├── <b>filebrowser-extension</b>                  │   ├── export.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── property-inspector.json                      │   ├── browser.json                       │   ├── panel.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── shell.json                                   │   ├── download.json                      │   ├── tools.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── top-bar.json                                 │   ├── open-browser-tab.json              │   └── tracker.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>apputils-extension</b>                               │   ├── open-with.json                     ├── <b>running-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── kernels-settings.json                        │   └── widget.json                        │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── notification.json                            ├── <b>fileeditor-extension</b>                   ├── <b>settingeditor-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── palette.json                                 │   ├── completer.json                     │   ├── form-ui.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── print.json                                   │   └── plugin.json                        │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── sanitizer.json                               ├── <b>help-extension</b>                         ├── <b>shortcuts-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── sessionDialogs.json                          │   ├── about.json                         │   └── shortcuts.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── themes.json                                  │   ├── jupyter-forum.json                 ├── <b>statusbar-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── utilityCommands.json                         │   └── launch-classic.json                │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>celltags-extension</b>                               ├── <b>htmlviewer-extension</b>                   ├── <b>terminal-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── plugin.json                                  │   └── plugin.json                        │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>cell-toolbar-extension</b>                           ├── <b>hub-extension</b>                          ├── <b>toc-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── plugin.json                                  │   └── menu.json                          │   └── registry.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>codemirror-extension</b>                             ├── <b>imageviewer-extension</b>                  ├── <b>tooltip-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── plugin.json                                  │   └── plugin.json                        │   ├── consoles.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>completer-extension</b>                              ├── <b>inspector-extension</b>                    │   ├── files.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── inline-completer.json                        │   ├── consoles.json                      │   └── notebooks.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── manager.json                                 │   ├── inspector.json                     ├── <b>translation-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>console-extension</b>                                │   └── notebooks.json                     │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── completer.json                               ├── <b>launcher-extension</b>                     └── <b>workspaces-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── foreign.json                                 │   └── plugin.json                            ├── indicator.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── tracker.json                                 ├── <b>logconsole-extension</b>                       ├── menu.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>csvviewer-extension</b>                              │   └── plugin.json                            └── sidebar.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── csv.json                                     ├── <b>lsp-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── tsv.json                                     │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>debugger-extension</b>                               ├── <b>mainmenu-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── main.json                                    │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── <b>docmanager-extension</b>                             ├── <b>markdownviewer-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   ├── download.json                                │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;│   └── plugin.json                                  ├── <b>mathjax-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;└── <b>documentsearch-extension</b>                         │   └── plugin.json<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;   └── plugin.json                                  └── <b>metadataform-extension</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;   └── metadataforms.json<br />
<br />
<br />
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ServerApp</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">authorizer​_​class</td>
<td class="org-left">jupyter​_​server.auth.authorizer.AllowAllAuthorizer</td>
</tr>

<tr>
<td class="org-left">config​_​manager​_​class</td>
<td class="org-left">jupyter​_​server.services.config.manager.ConfigManager</td>
</tr>

<tr>
<td class="org-left">contents​_​manager​_​class</td>
<td class="org-left">jupyter​_​server.services.contents.largefilemanager.AsyncLargeFileManager</td>
</tr>

<tr>
<td class="org-left">identity​_​provider​_​class</td>
<td class="org-left">jupyter​_​server.auth.identity.PasswordIdentityProvider</td>
</tr>

<tr>
<td class="org-left">kernel​_​manager​_​class</td>
<td class="org-left">jupyter​_​server.services.kernels.kernelmanager.MappingKernelManager</td>
</tr>

<tr>
<td class="org-left">kernel​_​spec​_​manager​_​class</td>
<td class="org-left">builtins.object</td>
</tr>

<tr>
<td class="org-left">kernel​_​websocket​_​connection​_​class</td>
<td class="org-left">jupyter​_​server.services.kernels.connection.base.BaseKernelWebsocketConnection</td>
</tr>

<tr>
<td class="org-left">login​_​handler​_​class</td>
<td class="org-left">jupyter​_​server.auth.login.LegacyLoginHandler</td>
</tr>

<tr>
<td class="org-left">logout​_​handler​_​class</td>
<td class="org-left">jupyter​_​server.auth.logout.LogoutHandler</td>
</tr>

<tr>
<td class="org-left">session​_​manager​_​class</td>
<td class="org-left">builtins.object</td>
</tr>
</tbody>
</table>


</pre>
</div>
</body>
</html>
